{"id":5970,"date":"2020-08-11T18:59:03","date_gmt":"2020-08-11T18:59:03","guid":{"rendered":"https:\/\/tiekeholdingbv.com\/product\/import-placeholder-for-5753\/"},"modified":"2020-08-11T18:59:17","modified_gmt":"2020-08-11T18:59:17","slug":"blood-pressure-test-machine","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/blood-pressure-test-machine\/","title":{"rendered":"Blood Pressure Test Machine"},"content":{"rendered":"<p>Arterial blood pressure is most commonly measured via a sphygmomanometer, which historically used the height of a column of mercury to reflect the circulating pressure. Blood pressure values are generally reported in millimetres of mercury (mmHg), though aneroid and electronic devices do not contain mercury.<\/p>\n<p>For each heartbeat, blood pressure varies between systolic and diastolic pressures. Systolic pressure is peak pressure in the arteries, which occurs near the end of the cardiac cycle when the ventricles are contracting. Diastolic pressure is minimum pressure in the arteries, which occurs near the beginning of the cardiac cycle when the ventricles are filled with blood. An example of normal measured values for a resting, healthy adult human is 120 mmHg systolic and 80 mmHg diastolic (written as 120\/80 mmHg, and spoken as “one-twenty over eighty”).<\/p>\n<p>Systolic and diastolic arterial blood pressures are not static but undergo natural variations from one heartbeat to another and throughout the day (in a circadian rhythm). They also change in response to stress, nutritional factors, drugs, disease, exercise, and momentarily from standing up. Sometimes the variations are large. Hypertension refers to arterial pressure being abnormally high, as opposed to hypotension, when it is abnormally low. Along with body temperature, respiratory rate, and pulse rate, blood pressure is one of the four main vital signs routinely monitored by medical professionals and healthcare providers.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Arterial blood pressure is most commonly measured via a sphygmomanometer, which historically used the height of a column of mercury to reflect the circulating pressure. Blood pressure values are generally reported in millimetres of mercury (mmHg), though aneroid and electronic devices do not contain mercury. For each heartbeat, blood pressure varies between systolic and diastolic [&hellip;]<\/p>\n","protected":false},"featured_media":6000,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/5970"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6000"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=5970"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}