{"id":5971,"date":"2020-08-11T18:59:04","date_gmt":"2020-08-11T18:59:04","guid":{"rendered":"https:\/\/tiekeholdingbv.com\/product\/import-placeholder-for-5756\/"},"modified":"2020-08-11T18:59:20","modified_gmt":"2020-08-11T18:59:20","slug":"disposable-medical-injection","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/disposable-medical-injection\/","title":{"rendered":"Disposable Medical Injection"},"content":{"rendered":"<p>A syringe is a simple reciprocating pump consisting of a plunger (though in modern syringes, it is actually a piston) that fits tightly within a cylindrical tube called a barrel. The plunger can be linearly pulled and pushed along the inside of the tube, allowing the syringe to take in and expel liquid or gas through a discharge orifice at the front (open) end of the tube. The open end of the syringe may be fitted with a hypodermic needle, a nozzle or tubing to direct the flow into and out of the barrel. Syringes are frequently used in clinical medicine to administer injections, infuse intravenous therapy into the bloodstream, apply compounds such as glue or lubricant, and draw\/measure liquids.<\/p>\n<p>The barrel of a syringe is made of plastic or glass, usually has graduated marks indicating the volume of fluid in the syringe, and is nearly always transparent. Glass syringes may be sterilized in an autoclave. However, most modern medical syringes are plastic with a rubber piston, because this type seals much better between the piston and the barrel and because they are cheap enough to dispose of after being used only once, reducing the risk of spreading blood-borne diseases. Reuse of needles and syringes has caused spread of diseases, especially HIV and hepatitis, among intravenous drug users. Syringes are also commonly reused by diabetics, as they can go through several in a day with multiple daily insulin injections, which becomes an affordability issue for many. Even though the syringe and needle are only used by a single person, this practice is still unsafe as it can introduce bacteria from the skin into the bloodstream and cause serious and sometimes lethal infections. In medical settings, single-use needles and syringes effectively reduce the risk of cross-contamination<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A syringe is a simple reciprocating pump consisting of a plunger (though in modern syringes, it is actually a piston) that fits tightly within a cylindrical tube called a barrel. The plunger can be linearly pulled and pushed along the inside of the tube, allowing the syringe to take in and expel liquid or gas [&hellip;]<\/p>\n","protected":false},"featured_media":6001,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/5971"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6001"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=5971"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}