{"id":5972,"date":"2020-08-11T18:59:04","date_gmt":"2020-08-11T18:59:04","guid":{"rendered":"https:\/\/tiekeholdingbv.com\/product\/import-placeholder-for-5758\/"},"modified":"2020-08-11T18:59:23","modified_gmt":"2020-08-11T18:59:23","slug":"n95-face-mask","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/n95-face-mask\/","title":{"rendered":"N95 Face Mask"},"content":{"rendered":"<p>NIOSH air filtration rating refers to the publications of National Institute for Occupational Safety and Health (NIOSH) of the US government pertaining to respirators and masks worn to filter contaminated air, regardless of cause. It is different from the European classification.<\/p>\n<p>The most common is N95, which is recommended by the US Centers for Disease Control and Prevention (CDC) for most cases of air contamination. These filters are designed to seal tightly around mouth and nose and are made of material certified to block 95% of particles 0.3 μm or larger in diameter, which include PM2.5. They are insufficient to stop most dry individual viruses, which typically range from 0.004 to 0.3 μm, but many viruses only survive in droplet of watery fluid (e.g., sputum), which may be blocked by a mask. They are however “… relatively difficult to breath through …”, and their full effectiveness also depends on a good fit – NIOSH recommends that each respirator wearer receive “… an initial fit test and annual fit tests thereafter”. Those considered equivalent to N95 are: European FFP2, China KN95, AS\/NZ P2, Korea 1st Class, and Japan DS.<\/p>\n<p>Plain surgical masks are standard for staff in hospital operating rooms, and often recommended to the public as part of avoiding seasonal flu. They do not carry a NIOSH rating. They are designed to filter out relatively large particles, such as sputum droplets and hair – but the World Health Organization, Society for Healthcare Epidemiology of America, the Infectious Diseases Society of America, the Association for Professionals in Infection Control and Epidemiology, and the American College of Occupational and Environmental Medicine all recommend these except in cases of “high risk”.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>NIOSH air filtration rating refers to the publications of National Institute for Occupational Safety and Health (NIOSH) of the US government pertaining to respirators and masks worn to filter contaminated air, regardless of cause. It is different from the European classification. The most common is N95, which is recommended by the US Centers for Disease [&hellip;]<\/p>\n","protected":false},"featured_media":6002,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/5972"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6002"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=5972"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}