{"id":5973,"date":"2020-08-11T18:59:04","date_gmt":"2020-08-11T18:59:04","guid":{"rendered":"https:\/\/tiekeholdingbv.com\/product\/import-placeholder-for-5760\/"},"modified":"2020-08-11T18:59:26","modified_gmt":"2020-08-11T18:59:26","slug":"suction-catheter","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/suction-catheter\/","title":{"rendered":"Suction Catheter"},"content":{"rendered":"<p>In medicine, a catheter is a thin tube made from medical grade materials serving a broad range of functions. Catheters are medical devices that can be inserted in the body to treat diseases or perform a surgical procedure. By modifying the material or adjusting the way catheters are manufactured, it is possible to tailor catheters for cardiovascular, urological, gastrointestinal, neurovascular, and ophthalmic applications.<\/p>\n<p>Catheters can be inserted into a body cavity, duct, or vessel. Functionally, they allow drainage, administration of fluids or gases, access by surgical instruments, and also perform a wide variety of other tasks depending on the type of catheter.[1] The process of inserting a catheter is “catheterization”. In most uses, a catheter is a thin, flexible tube (“soft” catheter) though catheters are available in varying levels of stiffness depending on the application. A catheter left inside the body, either temporarily or permanently, may be referred to as an “indwelling catheter” (for example, a peripherally inserted central catheter). A permanently inserted catheter may be referred to as a “permcath” (originally a trademark).<\/p>\n<p>The catheter used for hemodialysis is a tunneled catheter because it is placed under the skin. There are two types of tunneled catheters: cuffed or non-cuffed. Non-cuffed tunneled catheters are used for emergencies and for short periods (up to 3 weeks). Tunneled cuffed catheters, a type recommended by the NKF for temporary access, can be used for longer than 3 weeks when: – An AV fistula or graft has been placed but is not yet ready for use.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In medicine, a catheter is a thin tube made from medical grade materials serving a broad range of functions. Catheters are medical devices that can be inserted in the body to treat diseases or perform a surgical procedure. By modifying the material or adjusting the way catheters are manufactured, it is possible to tailor catheters [&hellip;]<\/p>\n","protected":false},"featured_media":6003,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/5973"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6003"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=5973"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}