{"id":5974,"date":"2020-08-11T18:59:04","date_gmt":"2020-08-11T18:59:04","guid":{"rendered":"https:\/\/tiekeholdingbv.com\/product\/import-placeholder-for-5762\/"},"modified":"2020-08-11T18:59:31","modified_gmt":"2020-08-11T18:59:31","slug":"sugar-level-test-machine","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/sugar-level-test-machine\/","title":{"rendered":"Sugar Level Test Machine"},"content":{"rendered":"<div class=\"wpb_text_column wpb_content_element \">\n<div class=\"wpb_wrapper\">\n<p>A glucose meter is a medical device for determining the approximate concentration of glucose in the blood. It can also be a strip of glucose paper dipped into a substance and measured to the glucose chart. It is a key element of home blood glucose monitoring (HBGM) by people with diabetes mellitus or hypoglycemia. A small drop of blood, obtained by pricking the skin with a lancet, is placed on a disposable test strip that the meter reads and uses to calculate the blood glucose level. The meter then displays the level in units of mg\/dl or mmol\/l.<\/p>\n<p>Since approximately 1980, a primary goal of the management of type 1 diabetes and type 2 diabetes mellitus has been achieving closer-to-normal levels of glucose in the blood for as much of the time as possible, guided by HBGM several times a day. The benefits include a reduction in the occurrence rate and severity of long-term complications from hyperglycemia as well as a reduction in the short-term, potentially life-threatening complications of hypoglycemia.<\/p>\n<p>Test strips that changed color and could be read visually, without a meter, have been widely used since the 1980s. They had the added advantage that they could be cut longitudinally to save money. Critics argued that test strips read by eye are not as accurate or convenient as meter testing. The manufacturer cited studies that show the product is just as effective despite not giving an answer to one decimal place, something they argue is unnecessary for control of blood sugar. This debate also happened in Germany where “Glucoflex-R” was an established strip for type 2 diabetes. As meter accuracy and insurance coverage improved, they lost popularity.<\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>A glucose meter is a medical device for determining the approximate concentration of glucose in the blood. It can also be a strip of glucose paper dipped into a substance and measured to the glucose chart. It is a key element of home blood glucose monitoring (HBGM) by people with diabetes mellitus or hypoglycemia. A [&hellip;]<\/p>\n","protected":false},"featured_media":6004,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/5974"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6004"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=5974"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}