{"id":5975,"date":"2020-08-11T18:59:05","date_gmt":"2020-08-11T15:59:05","guid":{"rendered":"https:\/\/tiekeholdingbv.com\/product\/import-placeholder-for-5767\/"},"modified":"2020-09-07T13:44:34","modified_gmt":"2020-09-07T10:44:34","slug":"face-mask","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/face-mask\/","title":{"rendered":"Face Mask"},"content":{"rendered":"<p>A surgical mask, also known as a procedure mask or medical mask, is intended to be worn by health professionals during surgery and during nursing to catch the bacteria shed in liquid droplets and aerosols from the wearer’s mouth and nose. They are not designed to protect the wearer from inhaling airborne bacteria or virus particles and are less effective than respirators, such as N95 or FFP masks, which provide better protection due to their material, shape and tight seal.<\/p>\n<p>Surgical masks are popularly worn by the general public all year round in East Asian countries like China, Japan and South Korea to reduce the chance of spreading airborne diseases and to prevent the breathing in of airborne dust particles created by air pollution. Additionally, surgical masks have become a fashion statement, particularly in contemporary East Asian culture bolstered by its popularity in Japanese and Korean pop culture which have a big impact on East Asian youth culture.<\/p>\n<p>More recently, due to the rising issue of smog in South and Southeast Asia, surgical masks and air filtering face masks are now frequently used in major cities in Thailand, India and Nepal when air quality deteriorates to toxic levels. Additionally, face masks are used in Singapore, Malaysia and Indonesia during the Southeast Asian haze season.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A surgical mask, also known as a procedure mask or medical mask, is intended to be worn by health professionals during surgery and during nursing to catch the bacteria shed in liquid droplets and aerosols from the wearer’s mouth and nose. They are not designed to protect the wearer from inhaling airborne bacteria or virus [&hellip;]<\/p>\n","protected":false},"featured_media":6005,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/5975"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6005"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=5975"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}