{"id":5976,"date":"2020-08-11T18:59:05","date_gmt":"2020-08-11T18:59:05","guid":{"rendered":"https:\/\/tiekeholdingbv.com\/product\/import-placeholder-for-5769\/"},"modified":"2020-08-11T18:59:37","modified_gmt":"2020-08-11T18:59:37","slug":"surgical-gowns","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/surgical-gowns\/","title":{"rendered":"Surgical Gowns"},"content":{"rendered":"<p>A surgical gown is regulated by the FDA as a Class II medical device that requires a 510(k) premarket notification. A surgical gown is a personal protective garment intended to be worn by health care personnel during surgical procedures to protect both the patient and health care personnel from the transfer of microorganisms, body fluids, and particulate matter. Because of the controlled nature of surgical procedures, critical zones of protection have been described by national standards. As referenced in Figure 1: the critical zones include the chest from scapula to knees and sleeves from cuff to above the elbow. Surgical gowns can be used for any risk level (Levels 1-4). All surgical gowns must be labeled as a surgical gown.<\/p>\n<p>Surgical isolation gowns are used when there is a medium to high risk of contamination and a need for larger critical zones than traditional surgical gowns. Surgical isolation gowns, like surgical gowns, are regulated by the FDA as a Class II medical device that requires a 510(k) premarket notification. As referenced in Figure 2, all areas of the surgical isolation gown except bindings, cuffs, and hems are considered critical zones of protection and must meet the highest liquid barrier protection level for which the gown is rated. All seams must have the same liquid barrier protection as the rest of the gown. Additionally, the fabric of the surgical isolation gown should cover as much of the body as is appropriate for the intended use.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A surgical gown is regulated by the FDA as a Class II medical device that requires a 510(k) premarket notification. A surgical gown is a personal protective garment intended to be worn by health care personnel during surgical procedures to protect both the patient and health care personnel from the transfer of microorganisms, body fluids, [&hellip;]<\/p>\n","protected":false},"featured_media":6006,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/5976"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6006"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=5976"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}