{"id":5977,"date":"2020-08-11T18:59:06","date_gmt":"2020-08-11T18:59:06","guid":{"rendered":"https:\/\/tiekeholdingbv.com\/product\/import-placeholder-for-5771\/"},"modified":"2020-08-11T18:59:44","modified_gmt":"2020-08-11T18:59:44","slug":"surgical-scissors","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/surgical-scissors\/","title":{"rendered":"Surgical Scissors"},"content":{"rendered":"<p>Surgical scissors are surgical instruments usually used for cutting. They include bandage scissors, dissecting scissors, iris scissors, operating scissors, stitch scissors, tenotomy scissors, Metzenbaum scissors, plastic surgery scissors, and Mayo scissors. Surgical scissors are usually made of very hard stainless steel for ongoing toughness. Some scissors have tungsten carbide reinforcements along their cutting edges. The hardness of this material allows the manufacturers to create sharper edges, which allows for easier and smoother cuts and keeps the scissors sharp for longer.<\/p>\n<p>There are two types of scissors used in surgeries.<\/p>\n<ul>\n<li>Ring scissors look much like standard utility scissors with two finger loops.<\/li>\n<li>Spring forceps are small scissors used mostly in eye surgery or microsurgery. The handles end in flat springs connected with a pivot joint. The cutting action is achieved by pressing the handles together. As the pressure is released, the spring action opens the jaws.<\/li>\n<\/ul>\n<p>Scissors are available in various configurations like<\/p>\n<ul>\n<li>Blunt\/blunt blades<\/li>\n<li>Blunt\/sharp blades<\/li>\n<li>Sharp\/sharp blades<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Surgical scissors are surgical instruments usually used for cutting. They include bandage scissors, dissecting scissors, iris scissors, operating scissors, stitch scissors, tenotomy scissors, Metzenbaum scissors, plastic surgery scissors, and Mayo scissors. Surgical scissors are usually made of very hard stainless steel for ongoing toughness. Some scissors have tungsten carbide reinforcements along their cutting edges. The [&hellip;]<\/p>\n","protected":false},"featured_media":6014,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/5977"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6014"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=5977"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}