{"id":5978,"date":"2020-08-11T18:59:06","date_gmt":"2020-08-11T18:59:06","guid":{"rendered":"https:\/\/tiekeholdingbv.com\/product\/import-placeholder-for-5773\/"},"modified":"2020-08-11T18:59:48","modified_gmt":"2020-08-11T18:59:48","slug":"surgical-sponges","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/surgical-sponges\/","title":{"rendered":"Surgical Sponges"},"content":{"rendered":"<p>A surgical sponge was defined as cotton material (e.g. laparotomy sponge, raytec, cottonoid, towel, and kerlix) inserted during an invasive procedure to absorb fluids or isolate tissue, with the intention of removing the absorbent material prior to completion of the procedure.<\/p>\n<p>Gauze sponges are disposable medical supplies commonly used in medicine and surgery. They are ordinarily made of gauze and are used to absorb blood and other fluids as well as clean wounds. When used in surgery, they are called surgical sponges.<\/p>\n<p>Common sizes include 2 by 2 inches (5.1 cm × 5.1 cm), 3 by 3 inches (7.6 cm × 7.6 cm), and 4 by 4 inches (10 cm × 10 cm).<\/p>\n<p>The materials used in the manufacturing of gauze sponges for medical purposes include cotton and non-woven materials. In addition to its many sizes, plys, and fabrics, gauze sponges can also be sterile and non-sterile. The open weave design of gauze sponges assists with the removal of dead tissue from the skin surface as well as vertically wick fluid from the wound onto any secondary dressing to assist with preventing maceration of skin tissue.<\/p>\n<p>Surgical sponges left in body cavities after surgery may cause complications, and are a common sort of surgical error. For this reason, counting them as they are used and removed is a common checklist item. Some sponges include a radiopaque strip so that they can be located by X-ray.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A surgical sponge was defined as cotton material (e.g. laparotomy sponge, raytec, cottonoid, towel, and kerlix) inserted during an invasive procedure to absorb fluids or isolate tissue, with the intention of removing the absorbent material prior to completion of the procedure. Gauze sponges are disposable medical supplies commonly used in medicine and surgery. They are [&hellip;]<\/p>\n","protected":false},"featured_media":6015,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/5978"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6015"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=5978"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}