{"id":5980,"date":"2020-08-11T18:59:09","date_gmt":"2020-08-11T18:59:09","guid":{"rendered":"https:\/\/tiekeholdingbv.com\/product\/import-placeholder-for-5777\/"},"modified":"2020-08-11T18:59:53","modified_gmt":"2020-08-11T18:59:53","slug":"contour-test-strips","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/contour-test-strips\/","title":{"rendered":"Contour Test Strips"},"content":{"rendered":"<p>When blood is placed onto the test strip, it reacts with a chemical called glucose oxidase producing gluconic acid from the glucose in the blood. At the other end of the test strip, the meter transfers a current to the test strip. The test strip has electric terminals which allow the meter to measure the current between the terminals.<\/p>\n<p>The current between the terminals changes depending on the level of gluconic acid that has been produced. The blood glucose meter then uses an algorithm to work out the blood glucose level based upon the difference in current.<\/p>\n<p>Some blood glucose test strips allow the reapplication of more blood to the same test strip if needed during the test. The amount of blood required by a test strip can vary between manufacturers. Generally, between 0.5 μl to 1 μl of blood is required.&lt;\/&gt;<\/p>\n<p>Some test strips, not so commonly used these days, do not require a meter. When blood is placed on the active part of the strip and then wiped off after a specified number of seconds, the reagent will change colour and the result can be obtained by matching the colour of against a colour chart on the side of the pot.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When blood is placed onto the test strip, it reacts with a chemical called glucose oxidase producing gluconic acid from the glucose in the blood. At the other end of the test strip, the meter transfers a current to the test strip. The test strip has electric terminals which allow the meter to measure the [&hellip;]<\/p>\n","protected":false},"featured_media":6017,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/5980"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6017"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=5980"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}