{"id":5982,"date":"2020-08-11T18:59:09","date_gmt":"2020-08-11T18:59:09","guid":{"rendered":"https:\/\/tiekeholdingbv.com\/product\/import-placeholder-for-5781\/"},"modified":"2020-08-11T18:59:57","modified_gmt":"2020-08-11T18:59:57","slug":"vivachek-test-strips","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/vivachek-test-strips\/","title":{"rendered":"Vivachek Test Strips"},"content":{"rendered":"<p>VivaChek Laboratories, Inc. was established in Wilmington, Delaware, USA in June 2013 with its primary function to serve the International market. Since then, it becomes a reliable manufacturer of POCT (point-of-caring testing) products and blood glucose monitoring systems with partners in over 70 countries worldwide. We also have a branch office, VivaChekLifeCare, located in Chennai, India, as well as a manufacturing center, VivaChek Biotech (Hangzhou) Co., Ltd, located in Hangzhou, China. In order to focus on the US market, Able Diagnostics Inc. was established in San Diego, California, USA in Oct 2017.<\/p>\n<p>VivaChek also focuses on investment in new product development. Most of our R &amp; D team members have more than 10 years of experience in POCT product development; they have already successfully optimized our products and are working on new product development intelligently and efficiently.<\/p>\n<p>VivaChek Laboratories has launched VivaChekTMIno and VivaChekTM FAD Blood Glucose Monitoring Systems in the international and Chinese markets, more than hundreds of million accurate glucose tests have been delivered worldwide, helping people with diabetes to live in a healthier life.<\/p>\n<p>In addition, VivaChek Laboratories launched the POCT Immunofluorescence Analyzer in the International market in 2018. The analyzer will include rapid tests with cardiac markers, renal functions, tumor markers, diabetes, infection, and hormone tests.VivaChek Laboratories also plans to launch a hemoglobin meter, a cholesterol test system, ketone \/ blood glucose \/ uric acid 4 in 1 analyzer and many other innovative instruments. We are committed to bringing user-friendly products to customers worldwide.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>VivaChek Laboratories, Inc. was established in Wilmington, Delaware, USA in June 2013 with its primary function to serve the International market. Since then, it becomes a reliable manufacturer of POCT (point-of-caring testing) products and blood glucose monitoring systems with partners in over 70 countries worldwide. We also have a branch office, VivaChekLifeCare, located in Chennai, [&hellip;]<\/p>\n","protected":false},"featured_media":6019,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/5982"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6019"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=5982"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}