{"id":5984,"date":"2020-08-11T18:59:10","date_gmt":"2020-08-11T18:59:10","guid":{"rendered":"https:\/\/tiekeholdingbv.com\/product\/import-placeholder-for-5785\/"},"modified":"2020-08-11T19:00:02","modified_gmt":"2020-08-11T19:00:02","slug":"accu-check-test-strips","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/accu-check-test-strips\/","title":{"rendered":"Accu Check Test Strips"},"content":{"rendered":"<p>Baumer Team S.R.O, Inc., the maker of Accu-Chek products, is a leading provider of blood sugar monitoring systems and insulin pumps. With more than 40 years experience, our number one goal is to help people living with diabetes track and manage their blood sugar so they may have better control of their health.<\/p>\n<p>Through well-established relationships with healthcare professionals, governments, and institutions in healthcare systems, we are able to meet the complex and changing needs of people with diabetes and their healthcare providers with highly innovative products and diabetes management solutions. We continually strive to create new products and resources to help fit better blood sugar control into our customers’ lifestyles.<\/p>\n<p>Baumer Team S.R.O, based in Indianapolis, Indiana, is a company with a proud history and continued commitment to innovation. Our products and services aim to make a difference by helping improve quality of life. Roche offers a broad range of diagnostic tests and systems that play a pivotal role in the groundbreaking area of integrated healthcare solutions. Our products cover the early detection, targeted screening, evaluation and monitoring of a variety of health issues.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Baumer Team S.R.O, Inc., the maker of Accu-Chek products, is a leading provider of blood sugar monitoring systems and insulin pumps. With more than 40 years experience, our number one goal is to help people living with diabetes track and manage their blood sugar so they may have better control of their health. Through well-established [&hellip;]<\/p>\n","protected":false},"featured_media":6021,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/5984"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6021"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=5984"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}