{"id":6386,"date":"2020-09-07T11:36:28","date_gmt":"2020-09-07T08:36:28","guid":{"rendered":"https:\/\/cosmetictradingbv.com\/?post_type=product&#038;p=6386"},"modified":"2020-09-07T11:36:29","modified_gmt":"2020-09-07T08:36:29","slug":"one-time-cleaning-latex-non-slip-gloves","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/one-time-cleaning-latex-non-slip-gloves\/","title":{"rendered":"One-Time Cleaning Latex Non-Slip Gloves"},"content":{"rendered":"<p>Made of high-density, stretch-resistant and durable. Wear-resistant, strong protection, acid and alkali resistance, oil and dirt. The gloves are non-slip design, providing a good grip and ensuring that the objects are not slipping.<\/p>\n<p><strong>Process brief:<\/strong><\/p>\n<p>The rubber is first sliced by a rubber mixing machine, and then sliced and sent to a sol cylinder and a gasoline mixed sol. After the sol is emulsified and prepared, the latex intermediate tank is pumped. The rubber solution dissolved in gasoline is fed from the top of the distillation column, heated by steam distillation, and the light component gasoline is heated to a gas phase, and the gasoline gas is mixed and cooled by cold water in the oil and gas cooler. The oil-water mixture is then transferred to the oil-water separator and the oil moisture layer. The upper layer of gasoline is recovered, and the lower part of the water is pumped to the cooling tower for cooling. After cooling, the gas gasoline of the distillation tower is cooled; the distillation tower is sent to the latex mixing tank according to its own pressure, and the latex is separated from the centrifuge to separate the latex material of the glove. After being toned and filtered, it is ready for use.<\/p>\n<p>The glove model is first cleaned with acid and alkali and washed with water. The washed model is first immersed in hot water and heated to the immersion coagulant and dried for dipping. After dipping, the oven is initially dried, added with fiber inner sleeve, washed with hot water and then sent to the oven for vulcanization and drying. After the mold is released from the mold, the air is inspected, low-temperature shaped, dried at medium temperature, washed, dehydrated, dried, and then packaged for delivery to the finished product warehouse.<\/p>\n","protected":false},"excerpt":{"rendered":"<p><strong>Material:<\/strong> latex<br \/>\n<strong>Color:<\/strong> beige<br \/>\n<strong>Size:<\/strong> S\/M\/L<br \/>\n<strong>Packing:<\/strong> 100 pieces \/ box<br \/>\n<strong>Weight:<\/strong> 8g<\/p>\n","protected":false},"featured_media":6387,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/6386"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6387"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=6386"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}