{"id":6518,"date":"2021-01-29T20:33:33","date_gmt":"2021-01-29T17:33:33","guid":{"rendered":"https:\/\/cosmetictradingbv.com\/product\/import-placeholder-for-6660\/"},"modified":"2021-01-29T20:33:36","modified_gmt":"2021-01-29T17:33:36","slug":"disposable-blood-transfusion-set","status":"publish","type":"product","link":"https:\/\/cosmetictradingbv.com\/product\/disposable-blood-transfusion-set\/","title":{"rendered":"Disposable Blood Transfusion Set"},"content":{"rendered":"<p><strong>Disposable blood transfusion set<\/strong><\/p>\n<ol class=\" list-paddingleft-2\">\n<li>Material: polypropylene<\/li>\n<li>Application: used for human blood transfusion<\/li>\n<li>Steel needle spike and plastic spike available<\/li>\n<li>Series available: BT-1, BT-3, BT-4, BT-5, BT-6<\/li>\n<li>Luer slip adapter with hypodermic needle<\/li>\n<li>Sterilization: ethylene-gas-sterilization<\/li>\n<li>Expiration date: 3 years from the date of manufacture<\/li>\n<li>Sanitary standard and quality in accordance with the CE, FDA, ISO9001, ISO13485 standards<\/li>\n<li>Packing: PE package or blister package. OEM can be arranged<\/li>\n<\/ol>\n<p><img title=\"Blood transfusion set\" src=\"https:\/\/img.waimaoniu.net\/1453\/1453-201909091545115684.jpg\" alt=\"Blood transfusion set\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>Disposable blood transfusion set device with medical grade polyvinyl chloride as the main raw material with protective sleeve, puncture device, blood and blood product filter net, dropper, drip bucket, drip bucket outlet hose, flow regulator, plug-in conical joint, Medical device consisting of accessories such as liquid injection parts. It can be used to save patients with major bleeding or blood transfusion during surgery. After use, it can be discarded to avoid cross-infection and ensure safe use.<\/p>\n<p>product advantages:<\/p>\n<p>The filter membrane of the precision filter is made of polyethersulfone. The filtration rate is high, reaching more than 99%; the infusion speed is fast, there is no clogging phenomenon; the biocompatibility is good, there is no drug adsorption; no foreign matter falls off in the downstream, and no secondary pollution is caused;the filter design is exquisite, exhaust fast. No bubbles remain; no leakage;<\/p>\n<p>The infusion pipeline adopts high-quality and high-elastic material, the pipe wall is smooth, it is not easy to adhere to air bubbles, the material is soft and not easy to be discounted, and it can also meet the infusion requirements well in winter;the use of imported intravenous infusion needle, sharp needle tip, good rigidity.<\/p>\n<p>Product specifications:<\/p>\n<p>In order to meet different clinical needs, a variety of filter pore filter membranes were designed, which are 5.0um, 3.0um, 2.0um, 1.2um0.2um, which are the most complete domestic specifications, and each type has domestic filter. And imported filters are available. Insert bottle needle, double steel needle, new patented plastic steel insert needle, integrated curved plastic insert needle.<\/p>\n<p>The scope of use of each regulation:<\/p>\n<p>Applicable people: children, elderly patients, chemotherapy patients, postoperative patients, critically ill patients, cardiovascular patients, patients who need long-term infusion.<\/p>\n<p>Applicable drugs: traditional Chinese medicine, antibiotics, nutrient solution, potassium chloride, fructose, mannitol, fat emulsion, chemotherapy drugs, lansalazole for injection, etc.<\/p>\n","protected":false},"excerpt":{"rendered":"<div class=\"product-attributes-item\">\n<ul>\n<li><label>Brand <\/label><span class=\"info-deta\">None<\/span><\/li>\n<li><label>Product origin <\/label><span class=\"info-deta\">Made in China<\/span><\/li>\n<li><label>Delivery time <\/label><span class=\"info-deta\">According to quantity<\/span><\/li>\n<li><label>Supply capacity <\/label><span class=\"info-deta\">500,000 pcs\/month<\/span><\/li>\n<\/ul>\n<\/div>\n<div class=\"product-overview\">\n<p>FEATURES ::<br \/>\nAvailable in Single-drip\/Double-drip chamber variants.<br \/>\nsoft kink resistance and translucent tubing is prepared from medical treated PVC material.<br \/>\nApprox 200 micron blood filter and 18 G hypodermic needle<br \/>\nStrong and sharp spike for easy insertion in Blood container.<br \/>\nRoller clamp able to control the flow of the blood infusion also do not kink on the tube.<br \/>\nDrip chamber with filter mesh to keep out blood clots from entering the patient&#8221;s circulation.<\/p>\n<\/div>\n","protected":false},"featured_media":6529,"template":"","meta":[],"_links":{"self":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product\/6518"}],"collection":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/types\/product"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media\/6529"}],"wp:attachment":[{"href":"https:\/\/cosmetictradingbv.com\/wp-json\/wp\/v2\/media?parent=6518"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}